[
  {
    "Condition ID": "v70-0x100001",
    "Severity": "CRITICAL",
    "Call home": "True",
    "Alert name": "High MemoryUsage",
    "Description": "Memory usage on this director exceeds the threshold. ",
    "RCA": "Either a memory leakhasoccurred orthe metronode hasexceeded itsconfiguration limits.",
    "Corrective action": "Contact Dell Customer Support. ",
    "Event source": "DIRECTOR",
    "Alert type": "Operational",
    "ID":  "v70-1"
  },
  {
    "Condition ID": "v70-0x100002",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Env File UpdateFailure",
    "Description": "An update to an internal environment file failed. ",
    "RCA": "An update to aninternalenvironmentfile failed.",
    "Corrective action": "Contact Dell Customer Support. ",
    "Event source": "DIRECTOR",
    "Alert type": "Operational",
    "ID":  "v70-2"
  },
  {
    "Condition ID": "v70-0x10001",
    "Severity": "CRITICAL",
    "Call home": "True",
    "Alert name": "Director Scope TestAlarm",
    "Description": "TEST: It is an example director scope alarm message. ",
    "RCA": "It is an exampleRCA for thedirector-scope testalarm.",
    "Corrective action": "It is an example external remedy for the director- scope test alarm. ",
    "Alert type": "Alarm",
    "ID":  "v70-3"
  },
  {
    "Condition ID": "v70-0x10006",
    "Severity": "CRITICAL",
    "Call home": "True",
    "Alert name": "Director level TestOperationalAlert",
    "Description": "TEST: It is an example director scope alarm message. ",
    "RCA": "It is an exampleRCA for thedirector-scopeoperationaltest event.",
    "Corrective action": "It is an example external remedy for the director- scope operational test event. ",
    "Alert type": "Operational",
    "ID":  "v70-4"
  },
  {
    "Condition ID": "v70-0x110001",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "IP Interface StateChange",
    "Description": "The IP port state has changed. ",
    "RCA": "Link went down on aport.Dependingon the portrole, aphysicalpath to localor remotecluster hasbeen lost.",
    "Corrective action": "Link went down on a        port.        Depending        on the port        role, a        physical        path to the        local or        remote        cluster has        been lost.        Perform the        following        steps: 1.        Check the        state of the        port, and        ensure that it is enabled.2. Check the cable and the SFP, and ensure they are properly plugged in.3. Check the switch if applicable, and ensure it is operational and the correspondi ng port is enabled. 4. If the link remains down, contact Dell Customer Support.",
    "Event source": "IPPORT",
    "Alert type": "Alarm",
    "ID":  "v70-5"
  },
  {
    "Condition ID": "v70-0x20001",
    "Severity": "CRITICAL",
    "Call home": "True",
    "Alert name": "Array No Access",
    "Description": "Storage Array is not seen through this director.",
    "RCA": "Storage Array is not reachable through this director.",
    "Corrective action": "Check for faulty hardware: verify the health of the cables, backend switches, and array. Contact Dell Customer Support if the problem persists.",
    "Event source": "ARRAY",
    "Alert type": "Alarm",
    "ID":  "v70-6"
  },
  {
    "Condition ID": "v70-0x20002",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Unreliable ITNexus Banished",
    "Description": "The IT nexus has been automaticall y taken out of service (banished) due to poor reliability in order to prevent performanc e impact.",
    "RCA": "The Initiator- Target connectionis failing and is out of service.Once the reliability improves the metro node automaticall y resumes using it.",
    "Corrective action": "Check for faulty hardware: verify the health of the cables, backend switches, and array. Contact Dell Customer Support if the problem persists.",
    "Event source": "ITNEXUS",
    "Alert type": "Alarm",
    "ID":  "v70-7"
  },
  {
    "Condition ID": "v70-0x20003",
    "Call home": "True",
    "Alert name": "Array Cluster Wide Redundant Access Loss",
    "Description": "The storage array is not accessible either from n-1 (or) n directors.",
    "RCA": "The storage array is not accessible from all directors in the cluster.",
    "Corrective action": "Check for faulty hardware: verify the health of the cables, backend switches, and array. Contact Dell Customer Support if the problem persists.",
    "Event source": "ARRAY",
    "Alert type": "Alarm",
    "ID":  "v70-8"
  },
  {
    "Condition ID": "v70-0x20004",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Unit Busy Condition",
    "Description": "The logical unit is busy more often than is normal and may impact performanc e.",
    "RCA": "The array hasreturned the SCSI BUSYstatus to metro node I/O requests for thisstorage- volume more often than what is considered acceptable.",
    "Corrective action": "The cause of busy condition on the storage array should be investigated. Investigate the health of the storage array, backend fabric. and metro node backend port to determine the source of the issue. Contact Dell Customer Support if there are performanc e problems.",
    "Event source": "LOGICALUN IT",
    "Alert type": "Alarm",
    "ID":  "v70-9"
  },
  {
    "Condition ID": "v70-0x20005",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Unit Alua Support Inconsistent",
    "Description": "ALUAsupport is incorrectly configured on LU.",
    "RCA": "An inconsistent ALUAsupport level has been detected for a logical unit.",
    "Corrective action": "Check the ALUAconfiguratio n on the array. All paths to a logical unit should be configured with the same failover mode.",
    "Event source": "LOGICALUN IT",
    "Alert type": "Alarm",
    "ID":  "v70-10"
  },
  {
    "Condition ID": "v70-0x20006",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Unit Path Type Inconsistent",
    "Description": "A Logical Unit reported an inconsistent path type for the array.Recovery attempts failed, and the unit has been banished.",
    "RCA": "A logical unit has inconsistent path types. Exhausted attempts to correct it through refresh and have banished the unit.",
    "Corrective action": "Engage the array vendor or Dell Customer Support to investigate why the logical unit has inconsistent path types.",
    "Event source": "LOGICALUN IT",
    "Alert type": "Alarm",
    "ID":  "v70-11"
  },
  {
    "Condition ID": "v70-0x20007",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Array Not Supported SPC Version",
    "Description": "Array supports an SPC version NOTmatching 2,3 or 4.",
    "RCA": "Target device advertised a behavior which is not supported by the metro node initiator.",
    "Corrective action": "Switch the target device into a supported mode following metro node best practices for this device, do not use this target device, or the device may be less highly available than is recommend ed for normal operation.",
    "Event source": "ARRAY",
    "Alert type": "Alarm",
    "ID":  "v70-12"
  },
  {
    "Condition ID": "v70-0x20008",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Array Exceeds Max Controller",
    "Description": "Array exceeds maximum number of controllers allowed.",
    "RCA": "Logical Unit already has maximum controllers allowed on this array. Extra controller is being attempted to be added.",
    "Corrective action": "Check Array configuration. If problem persists, contact Dell Customer Support.",
    "Event source": "ARRAY",
    "Alert type": "Alarm",
    "ID":  "v70-13"
  },
  {
    "Condition ID": "v70-0x20009",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Unit Peripheral Qualifier Unexpected",
    "Description": "The logical unit reports unexpected peripheral qualifier.",
    "RCA": "A backend storage array Logical Unit has reported an unexpected peripheral qualifier.",
    "Corrective action": "Contact Dell Customer Support.",
    "Event source": "LOGICALUN IT",
    "Alert type": "Alarm",
    "ID":  "v70-14"
  },
  {
    "Condition ID": "v70-0x2000a",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Array Serial Number Unexpected",
    "Description": "Storage Array returned an unexpected serial number.",
    "RCA": "The storage array reported an unexpected serial number.",
    "Corrective action": "Before using this array, check the storage- arrays context to ensure that multiple entries do not havethe same identifier, and that this array does not present multiple identifiers. If either of these conditions occur, do not use this array. The array name and version number should be reported to Dell Customer support.Continuing to use the array could lead to Data Unavailabilit y and Data Loss conditions and unreliable array behavior.",
    "Event source": "ARRAY",
    "Alert type": "Alarm",
    "ID":  "v70-15"
  },
  {
    "Condition ID": "v70-0x2000b",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Logical Unit Changed",
    "Description": "Logical Unit mappings change detected. For this ITL, a different Logical Unit is reported than what was reported earlier.",
    "RCA": "LU mapping on the storage array had changed.Depending on the state of the system (host IOs running or not), either Data Unavailable, Data Loss or Data Corruption might have already happened or might happen in future.",
    "Corrective action": "The system automaticall y runs a refresh to destroy the stale ITL to the old LUID and re- discover the ITL to the new LUID. Always follow the 'Remove Disk or Array' procedure in the metro node SolVe Desktop when de- provisioning storage- volumes and/or re- provisioning storage- volumes to metro node to ensure an 'array re- discover' is run in between changes in order to prevent LUNswapping from occurring.",
    "Event source": "ITLNEXUS",
    "Alert type": "Alarm",
    "ID":  "v70-16"
  },
  {
    "Condition ID": "v70-0x2000c",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Array No Failover Executor Director",
    "Description": "No suitable executor director to perform the failover of a group of Logical Units to a specific array controller.",
    "RCA": "It is likely indicative of severely degraded hardware and/or fabric condition. Restore connectivity to the array controllers for all directors.",
    "Corrective action": "Check the backend switches, and engage the array vendor to investigate why the failover to the array controller could not succeed.Contact Dell Customer Support if problem persists.",
    "Event source": "ARRAY",
    "Alert type": "Alarm",
    "ID":  "v70-17"
  },
  {
    "Condition ID": "v70-0x2000d",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Unit Reservation Conflict",
    "Description": "Reservation conflict response for command that is sent to the logical unit on a specific IT.",
    "RCA": "The logical unit is reserved through another initiator.",
    "Corrective action": "Contact your storage- administrato r to remove the reservation of the logical unit from either the one or more initiators or storage array.",
    "Event source": "LOGICALUN IT",
    "Alert type": "Alarm",
    "ID":  "v70-18"
  },
  {
    "Condition ID": "v70-0x2000e",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Scsi Deferred I/ O Error",
    "Description": "Received deferred error from a specific target for a previous command.",
    "RCA": "Metro node received deferred error from the specified target which indicates exception condition occurred on the target during processing of some previous command for which status was already returned. It can lead to Data Unavailabilit y/Data Loss.",
    "Corrective action": "Determine which back- end storage array the target corresponds to, and then engage the storage array Customer Support of vendor to determine the cause of the deferred error and to correct the exception condition on the target.",
    "Event source": "TARGET",
    "Alert type": "Alarm",
    "ID":  "v70-19"
  },
  {
    "Condition ID": "v70-0x30003",
    "Severity": "--",
    "Call home": "True",
    "Alert name": "Virtual Volume Redundancy Loss",
    "Description": "Virtual Volume redundancy has changed.",
    "RCA": "One or more factors have contributed to changing the redundancy of the given virtual volume.",
    "Corrective action": "Contact Dell Customer Support for assistance with restoring the redundancy of the virtual volume.",
    "Event source": "VIRTUALVO LUME",
    "Alert type": "Alarm",
    "ID":  "v70-20"
  },
  {
    "Condition ID": "v70-0x30004",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Storage Volume Unreachable",
    "Description": "Storage Volume accessibility has changed.",
    "RCA": "A storage volume attached to the system can no longer service I/O.",
    "Corrective action": "If the storage volume is unreachable, see Troubleshoo ting_Unreac hable_Stora ge_Volumes.",
    "Event source": "STORAGEV OLUME",
    "Alert type": "Alarm",
    "ID":  "v70-21"
  },
  {
    "Condition ID": "v70-0x30005",
    "Severity": "--",
    "Call home": "True",
    "Alert name": "System Device Redundancy Loss",
    "Description": "The system device has regained full redundancy.",
    "RCA": "One or more factors have contributed to changing the redundancy of the given system device.",
    "Corrective action": "Contact Dell Customer Support for assistance with restoring the redundancy of the system device.",
    "Event source": "METAVOLU ME",
    "Alert type": "Alarm",
    "ID":  "v70-22"
  },
  {
    "Condition ID": "v70-0x30006",
    "Severity": "CRITICAL",
    "Call home": "True",
    "Alert name": "Virtual Volume Suspended",
    "Description": "Virtual volume has been suspended for more than 10 seconds.",
    "RCA": "Asuspension of I/O applied to a virtual volume has lasted longer than a preconfigur ed threshold.",
    "Corrective action": "Contact Dell Customer Support for analysis of the factors contributing to the extended suspension.",
    "Event source": "VIRTUALVO LUME",
    "Alert type": "Alarm",
    "ID":  "v70-23"
  },
  {
    "Condition ID": "v70-0x30009",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Logging Volume Write Failed",
    "Description": "Write failed to logging volume. The mirror is marked out of date.",
    "RCA": "The system has lost access to the logging- volume device on which it is maintaining a list of changes to the reported distributed device. The specified mirror ofthe distributed device is marked out of date and rebuilt when possible.",
    "Corrective action": "Check the accessibility of the logging- volume component and check the accessibility of the underlying storage- volume of the mirror that is marked out of date. If necessary, to reconnect the inaccessible storage- volumes, take corrective actions.Contact Dell Customer Support for assistance.",
    "Event source": "LOGGINGV OLUME",
    "Alert type": "Operational",
    "ID":  "v70-24"
  },
  {
    "Condition ID": "v70-0x3000a",
    "Severity": "CRITICAL",
    "Call home": "True",
    "Alert name": "All Mirrors Out of Date",
    "Description": "All mirrors of the distributed device are out of date, choosing one mirror as up to date to allow access to the device.",
    "RCA": "All the mirrors of the specified distributed device had been marked out of date. In order to restore access to the device, and to minimize data loss, the specified mirror was marked as up to date.",
    "Corrective action": "Contact Dell Customer Support.",
    "Event source": "VIRTUALVO LUME",
    "Alert type": "Operational",
    "ID":  "v70-25"
  },
  {
    "Condition ID": "v70-0x3000b",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Device Name Conflict",
    "Description": "Name conflict detected between two devices, renaming the second occurrence.",
    "RCA": "Two discovered devices reported the same device name. It can occur if configuratio n changes are made when one or more storage volumes are unreachable , if storage devices  from separate metro node systems with existing devices are merged into one metro nodesystem or if a device becomes visible to both clusters and happens to have the same name as a cluster- local device on the other cluster.",
    "Corrective action": "Manual intervention is required. Contact Dell Customer Support to resolve the conflict.",
    "Event source": "DEVICE",
    "Alert type": "Operational",
    "ID":  "v70-26"
  },
  {
    "Condition ID": "v70-0x3000c",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Virtual Volume Name Conflict",
    "Description": "Name conflict detected between two virtual volumes, renaming the second occurrence.",
    "RCA": "Two discovered virtual volumes reported the same name. It can occur if configuratio n changes are made when one or more storage volumes are unreachable, if storage devices  from separate metro node systems with existing devices are merged into one metro nodesystem or if a virtual volume becomes visible to both clusters and happens to have the same name as a cluster- local virtual volume on the other cluster.",
    "Corrective action": "Manual intervention is required. Contact Dell Customer Support to resolve the conflict.",
    "Event source": "VIRTUALVO LUME",
    "Alert type": "Operational",
    "ID":  "v70-27"
  },
  {
    "Condition ID": "v70-0x3000d",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Automatic Detach Disallowed",
    "Description": "Automatic detach of the given cluster from the given device is disallowed to preserve consistency and avoid data loss.",
    "RCA": "The automatic detach of the given cluster from the given device was disallowed, in order to preserve consistency on the device and avoid losing data.",
    "Corrective action": "To resume I/O, all WAN links should be brought online.",
    "Event source": "VIRTUALVO LUME",
    "Alert type": "Operational",
    "ID":  "v70-28"
  },
  {
    "Condition ID": "v70-0x3000e",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Hide Storage Volume Provisioned To Other Cluster",
    "Description": "Hiding storage volume at the local cluster as this storage volume is also provisioned at the remote cluster.",
    "RCA": "A storage volume has been provisioned to this cluster, even though the storage volume logically belongs to the other cluster. This message likely indicates a back-end zoning or masking problem, because a storage volume should be provisioned to only one cluster.",
    "Corrective action": "Reconfigure the zoning and/or masking on the back- end so that each cluster can see only its local storage volumes.Run the 'array re- discover' command to remove the remote storage volumes.",
    "Event source": "STORAGEV OLUME",
    "Alert type": "Operational",
    "ID":  "v70-29"
  },
  {
    "Condition ID": "v70-0x3000f",
    "Severity": "CRITICAL",
    "Call home": "True",
    "Alert name": "Storage Volume Claimed From Multiple",
    "Description": "Storage volume is claimed at both the local and remote clusters.",
    "RCA": "The same storage volume has been not only presented to both clusters, but claimed at both clusters as well. If more than one cluster is doing I/O to the storage volume,  data corruption is likely.",
    "Corrective action": "1. Choose one cluster at which the storage volume should be used. 2. Tear down all configuratio ns involving the storage volume at the other cluster. 3. Remove visibility to the storage volume from the other cluster.",
    "Event source": "STORAGEV OLUME",
    "Alert type": "Operational",
    "ID":  "v70-30"
  },
  {
    "Condition ID": "v70-0x30010",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Mirror Marked Out Of Date",
    "Description": "A mirror of a RAID 1device has been marked fully out of date.",
    "RCA": "A write to a RAID 1device is successful to some mirrors, tat mirror is being marked as fully out of date, so that a subsequent rebuild can bring the mirror back up to date.",
    "Corrective action": "If the mirror is not still showing as out of date, it has likely auto corrected. If it is still marked out of date, investigate the back- end issues. Once those issues are resolved, the rebuild initiates automatically. It can take time depending on the number of active rebuilds on the system at the time. Contact Dell Customer Support if the condition persists.",
    "Event source": "METAVOLU ME",
    "Alert type": "Operational",
    "ID":  "v70-31"
  },
  {
    "Condition ID": "v70-0x30011",
    "Severity": "CRITICAL",
    "Call home": "True",
    "Alert name": "Metadata Volume Write Failed",
    "Description": "A write to a metadata volume is unsuccessfu l.",
    "RCA": "A write to the  specified metadata volume is failed. The changes are preserved in memory, but if the entire cluster fails or is shut down before the access to the metadata volume is restored and the changes can be written successfully to disk, the changes are lost. The system configuratio n information that is associated with those metadata write not written to the disk may be lost.",
    "Corrective action": "1. Fix the unhealthy or failed metadata volume, or underlying storage volumes through checking fabric connectivity and one or more storage arrays. 2. If the metadata volume cannot be restored to 'ok' state, create and move to a new metadata volume as soon as possible.",
    "Event source": "METAVOLU ME",
    "Alert type": "Operational",
    "ID":  "v70-32"
  },
  {
    "Condition ID": "v70-0x30012",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Metadata Volume Becoming Full",
    "Description": "A metadata volume has reached a preconfigur ed percentage of its capacity.",
    "RCA": "The metadata volume is running out of available space. This event does not indicate an immediate metadata volume failure.",
    "Corrective action": "See the troubleshoo ting entry for the issue in the Generator.",
    "Event source": "METAVOLU ME",
    "Alert type": "Operational",
    "ID":  "v70-33"
  },
  {
    "Condition ID": "v70-0x30013",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Storage Volume Latency Events Suppressed",
    "Description": "Generation of storage volume I/O latency events stopped to prevent event flooding.",
    "RCA": "To prevent event flooding, generation of I/O latency events has been stopped after emitting the maximum allowed number of events.",
    "Corrective action": "1. Use the metro node Unisphere performanc e monitoring stats to verify if there is still high average I/O latency on the backend. 2. Create storage- volume performanc e monitors in Vplexcli  to investigate individual storage- volume latency stats as needed to further investigate the cause of the performanc e degradation.3. Compare the storage- volume latency  stats to the latency on the storage array for the one or more volumes in question. If the latency on the array is not as high investigate the fabrics between the storage array and metro node.4. If the issue persists and unable to determine the cause engage Dell Customer Service.",
    "Event source": "CLUSTER",
    "Alert type": "Operational",
    "ID":  "v70-34"
  },
  {
    "Condition ID": "v70-0x30014",
    "Severity": "CRITICAL",
    "Call home": "True",
    "Alert name": "Device Detach Full Rebuild",
    "Description": "A complex sequence of failures has led to marking one mirror of a distributed device fully out of date, and to the temporary suspension of I/O on that distributed device.",
    "RCA": "A combination of failures involving metadata and disks offline at cluster followed by cluster partition and failed writes to a logging volume has led to temporary condition where the distributed device can no longer process I/O. Once this condition is resolved, a full rebuild occurs. This condition is necessary to avoid data corruption.",
    "Corrective action": "A full rebuild is started automaticall y once the clusters rejoin.Investigate why the clusters are partitioned and take any required actions to restore the WAN COMconnectivity so the clusters can rejoin.",
    "Event source": "DISTRIBUTE DDEVICE",
    "Alert type": "Operational",
    "ID":  "v70-35"
  },
  {
    "Condition ID": "v70-0x30015",
    "Severity": "CRITICAL",
    "Call home": "True",
    "Alert name": "Device Bad Config",
    "Description": "Metadata persisted to the metadata volume relating to the device, or storage volume in question has been detected to be inconsistent. Access to the device or storage volume has been disabled until the problem can be examined and remedied.",
    "RCA": "Metro node has detected an inconsistenc y in the persisted information relating to the configuratio n of the given device or disk. It may indicate a problem with the persisted information, or may simply be the result of a timing issue upon cluster or system bring up.",
    "Corrective action": "Contact Dell Customer Support for analysis and remedy of the problem.",
    "Event source": "DEVICE",
    "Alert type": "Alarm",
    "ID":  "v70-36"
  },
  {
    "Condition ID": "v70-0x30016",
    "Severity": "CRITICAL",
    "Call home": "True",
    "Alert name": "Virtual Volume Capacity Shrunk",
    "Description": "The capacity of a virtual volume has shrunk below the capacity with which it was created.",
    "RCA": "The capacity of a virtual volume has shrunk below the capacity with which it was created.",
    "Corrective action": "1. Examine the back- end arrays to determine why the storage has shrunk. 2. Resize the required back-end devices to their original size. 3. Contact Dell Customer Support.",
    "Event source": "VIRTUALVO LUME",
    "Alert type": "Alarm",
    "ID":  "v70-37"
  },
  {
    "Condition ID": "v70-0x30017",
    "Severity": "CRITICAL",
    "Call home": "True",
    "Alert name": "System Device Capacity Shrunk",
    "Description": "The capacity of a system device (metadata or logging) has shrunk below the capacity with which it was created.",
    "RCA": "The capacity of a system device (metadata or logging) has shrunk below the capacity with which it was created.",
    "Corrective action": "1. Examine the back- end arrays to determine why the storage has shrunk. 2. Resize the required back-end devices to their original size. 3.Contact Dell Customer Support.",
    "Event source": "METAVOLU ME",
    "Alert type": "Alarm",
    "ID":  "v70-38"
  },
  {
    "Condition ID": "v70-0x30018",
    "Severity": "CRITICAL",
    "Call home": "True",
    "Alert name": "Active Metadata Volume Unhealthy",
    "Description": "The active metadata volume has become unhealthy and is at risk.",
    "RCA": "The active meta- volume has become unhealthy and is at risk. It is in cache only, and must be written to storage volume.",
    "Corrective action": "The active meta- volume has become unhealthy. Either resolve the problem on the back end, or create another meta- volume using 'meta- volume create' as soon as possible, and then run the 'meta- volume move' command to save the cache data to the newly created meta- volume.Contact Dell Customer Support.",
    "Event source": "STORAGEV OLUME",
    "Alert type": "Alarm",
    "ID":  "v70-39"
  },
  {
    "Condition ID": "v70-0x30019",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Active Metadata Volume Missing",
    "Description": "Timed out waiting for the active metadata volume to arrive.",
    "RCA": "A fixed time has passed after the local cluster last booted, and the active metadata volume has not yet been detected.",
    "Corrective action": "Fix the problem with the active metadata volume, or activate a backup if no configuratio n changes have taken place since the backup. If there have been configuratio n changes, contact Dell Customer Support to restore from the backup.",
    "Event source": "METAVOLU ME",
    "Alert type": "Alarm",
    "ID":  "v70-40"
  },
  {
    "Condition ID": "v70-0x3001a",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Storage Volume Latency Degraded",
    "Description": "Storage volume I/O latency has increased above an acceptable threshold.",
    "RCA": "The average I/O latency on a storage volume has exceeded the acceptable limit, likely due to increased latency on the backend storage array or fabrics between the metro node and storage array.",
    "Corrective action": "1. Analyze the latency stats from the storage array for the volume in question at the time of the event to determine if it reported the same highlatency. Engage the storage array vendor as needed.2. If the storage array does not report the same latency at the time of the issue for the volume, then investigate the fabrics between the metro node and storage array. 3. If the issue persists and the cause cannot be determined engage Dell Customer Service.",
    "Event source": "STORAGEV OLUME",
    "Alert type": "Alarm",
    "ID":  "v70-41"
  },
  {
    "Condition ID": "v70-0x3001b",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Remote Device Latency Degraded",
    "Description": "Remote device I/O latency has increased above an acceptable threshold.",
    "RCA": "The average I/O latency on a remote device has exceeded the acceptable limit due to possible issues on the back- end or WAN link.",
    "Corrective action": "1. Use the metro node Unisphere performanc e monitoring stats to verify if there is high average I/O latency on the WAN COM links, or high average backend I/O latency on the cluster where the remote device resides, and investigate further as needed. 2. Create storage- volume performanc e monitors in Vplexcli to investigate individual storage- volume latency stats asmust further investigate the cause of the performanc e degradation.3. Compare the storage- volume latency  stats to the latency on the storage array for the one or more volumes in question. If the latency on the array is not high, investigate the fabrics between the storage array and metro node.4. If the issue persists and the cause cannot be determined, then engage Dell Customer Service.",
    "Event source": "DISTRIBUTE DDEVICE",
    "Alert type": "Alarm",
    "ID":  "v70-42"
  },
  {
    "Condition ID": "v70-0x3001c",
    "Severity": "CRITICAL",
    "Call home": "True",
    "Alert name": "Mirror Isolated",
    "Description": "A mirror of a RAID_1 device has been isolated due to severe performanc e degradation of its storage volume components.",
    "RCA": "All the storage volumes supporting this mirror are performing poorly, causing severe degradation in theRAID-1performance. To improve the RAID-1performanc e through the healthy legs, the IOs to the poorly performing mirror leg have been blocked.",
    "Corrective action": "Identify the cause of the poor performanc e of storage volume through seeing the troubleshoo ting entry related to degraded disks and isolated mirrors in the normal operation section of SolVe Procedure Generator (\"Recovery->Troubleshoo ting -> Problems during normal operation -> Degraded disks and isolated mirrors problems\"). If the underlying issues cannot be fixed in a timely manner, consider detaching the unhealthy mirror from the RAID-1 device and attaching a mirror based on healthy storage volumes to reinstate redundancy. Contact Dell Customer Support if the problem persists.",
    "Event source": "METAVOLU ME",
    "Alert type": "Alarm",
    "ID":  "v70-43"
  },
  {
    "Condition ID": "v70-0x3001d",
    "Severity": "INFO",
    "Call home": "False",
    "Alert name": "Metadata Copy Succeeded",
    "Description": "Successfully copied in- memory metadata to a metadata volume.",
    "RCA": "All in- memory metadata has been written out to the given metadata volume.",
    "Corrective action": "It is an informationa l event only.No action is required.",
    "Event source": "METAVOLU ME",
    "Alert type": "Operational",
    "ID":  "v70-44"
  },
  {
    "Condition ID": "v70-0x3001e",
    "Severity": "CRITICAL",
    "Call home": "False",
    "Alert name": "Metadata Copy Failed",
    "Description": "Failed to copy in- memory metadata to a metadata volume.",
    "RCA": "An attempt to write out all in- memory metadata to a metadata volume failed.",
    "Corrective action": "Examine the metadata volume to see if there are any problems that can be corrected, contacting Dell Customer Service for assistance if needed.",
    "Event source": "METAVOLU ME",
    "Alert type": "Operational",
    "ID":  "v70-45"
  },
  {
    "Condition ID": "v70-0x3001f",
    "Severity": "INFO",
    "Call home": "False",
    "Alert name": "Metadata Move Succeeded",
    "Description": "Successfully copied in- memory metadata to a metadata volume, which is now the active metadata volume.",
    "RCA": "All in- memory metadata has been written out to the given metadata volume, which is now the active metadata volume.",
    "Corrective action": "It is an informationa l event only. No action is required.",
    "Event source": "METAVOLU ME",
    "Alert type": "Operational",
    "ID":  "v70-46"
  },
  {
    "Condition ID": "v70-0x30020",
    "Severity": "CRITICAL",
    "Call home": "False",
    "Alert name": "Metadata Move Failed",
    "Description": "Failed to copy in- memory metadata to a metadata volume, and therefore the metadata volume has not been activated.",
    "RCA": "An attempt to write out all in- memory metadata to a metadata volume failed, and therefore that metadata volume has not been activated.",
    "Corrective action": "Examine the metadata volume to see if there are any problems that can be corrected, contacting Dell Customer Service for assistance if needed.",
    "Event source": "METAVOLU ME",
    "Alert type": "Operational",
    "ID":  "v70-47"
  },
  {
    "Condition ID": "v70-0x60001",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Cluster Partition",
    "Description": "Cluster has partitioned.",
    "RCA": "The last director with the given cluster id has departed. It marks the loss of the indicated cluster from the point of view of the reporting cluster.",
    "Corrective action": "The last director with the given cluster ID has departed. It marks the loss of the indicated cluster from the point of view of the reporting cluster. Check that the distributed- devices and consistency-groups are running on the winning cluster. A winner must be manually chosen. 1. Check for problems with the network link to the indicated cluster. 2. Check the equipment at the indicated cluster for malfunction s.",
    "Event source": "CLUSTER",
    "Alert type": "Alarm",
    "ID":  "v70-48"
  },
  {
    "Condition ID": "v70-0x60002",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Witness Com Node Untrustwort hy",
    "Description": "'Membershi p com connection to{remoteDire ctor}/{remoteDire ctorId} untrustwort hy:{qualifier} operational for{secondsSin ceOperation al} seconds.'",
    "RCA": "This failure exposes the cluster to a Data Unavailabilit y condition in certain director failure/ inter- director link failure scenarios.",
    "Corrective action": "Check the managemen t network cables and the correspondi ng managemen t modules.",
    "Event source": "DIRECTOR",
    "Alert type": "Operational",
    "ID":  "v70-49"
  },
  {
    "Condition ID": "v70-0x60003",
    "Severity": "CRITICAL",
    "Call home": "True",
    "Alert name": "Stonith Call Failed for remote director",
    "Description": "Stonith call failed for{remoteDire ctor}/{remoteDire ctorId}.",
    "RCA": "This director tried to kill the identified director, but the call to do that is failed.",
    "Corrective action": "Contact Dell Customer Support.",
    "Event source": "DIRECTOR",
    "Alert type": "Operational",
    "ID":  "v70-50"
  },
  {
    "Condition ID": "v70-0x60004",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Director Running Different Firmware",
    "Description": "Director running a different version of the software detected.",
    "RCA": "A director with a different version of firmware may have been inserted into the cluster. Also a communicat ions link could have been brought up by mistake, allowing a cluster of a different version to be visible.",
    "Corrective action": "If this situation arose because a director with a different version of firmware wasinserted into the cluster and booted, then shut down that director. If the situation arose because a communicat ions link has been brought up by mistake, then take down that communicat ions link.",
    "Event source": "CLUSTER",
    "Alert type": "Operational",
    "ID":  "v70-51"
  },
  {
    "Condition ID": "v70-0x60005",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Witness Com Node From Foreign Site",
    "Description": "Unexpected membership arrival uuid{directorId} appears from foreign cluster{foreignClus terId}.",
    "RCA": "A director from a foreign metro node cluster was unexpectedl y discovered through this cluster.",
    "Corrective action": "Contact Dell Customer Support to check if there has been a mis- configuratio n done between clusters in the environment.",
    "Event source": "CLUSTER",
    "Alert type": "Operational",
    "ID":  "v70-52"
  },
  {
    "Condition ID": "v70-0x90001",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "SCSI Target Reset received for host IT Nexus",
    "Description": "SCSI Target Reset received for host IT Nexus.",
    "RCA": "Host initiator has issued target reset due to slow I/O processing.",
    "Corrective action": "Check I/O processing statistics. Identify the reason for the host to issue Target Reset and resolve it. If the problem is with the host, unzone the initiator in question from the fabric to prevent potential performanc e impact to other hosts until the issue can be resolved.Contact Dell Customer Support if problem persists.",
    "Event source": "TARGETPO RT",
    "Alert type": "Operational",
    "ID":  "v70-53"
  },
  {
    "Condition ID": "v70-0x90002",
    "Severity": "CRITICAL",
    "Call home": "True",
    "Alert name": "Possible Stuck I/O detected on virtual volume",
    "Description": "Possible Stuck I/O detected on virtual volume.",
    "RCA": "An I/O failed to complete or be properly aborted and cleaned up.",
    "Corrective action": "Contact Dell Customer Support for assistance.",
    "Event source": "VIRTUALVO LUME",
    "Alert type": "Operational",
    "ID":  "v70-54"
  },
  {
    "Condition ID": "v70-0x90003",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Unmap Command Buffer Allocation Failed",
    "Description": "SCSI UNMAPcommand failed on virtual volume due to an internal memory allocation issue.",
    "RCA": "A Scsi Unmap command could not be processed because of an internal firmware memory allocation failure.",
    "Corrective action": "Run the collect- diagnostics utility to collect system information to determine why an internal firmware memory allocation failure is occurred. Contact Dell Customer Support.",
    "Event source": "VIRTUALVO LUME",
    "Alert type": "Operational",
    "ID":  "v70-55"
  },
  {
    "Condition ID": "v70-0x90004",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "SCSICompare And Write command that is failed on virtual volume due to an internal memory allocation issue",
    "Description": "SCSICompare And Write command that is failed on virtual volume due to an internal memory allocation issue.",
    "RCA": "The metro node director had insufficient memory resources to process the SCSICompare and Write Command.",
    "Corrective action": "Run collect- diagnostics utility to collect system information to determine why an internal firmware memory allocation failure is occurred.Contact Dell Customer Support.",
    "Event source": "VIRTUALVO LUME",
    "Alert type": "Operational",
    "ID":  "v70-56"
  },
  {
    "Condition ID": "v70-0x90005",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "SCSI Write Same (16) command failed on virtual volume due to an internal memory allocation issue",
    "Description": "SCSI Write Same (16) command failed on virtual volume due to an internal memory allocation issue.",
    "RCA": "The metro node director had insufficient memory resources to process the SCSI Write Same Command.",
    "Corrective action": "Run the collect- diagnostics utility to collect system information to determine why an internal firmware memory allocation failure is occurred. Contact Dell Customer Support.",
    "Event source": "VIRTUALVO LUME",
    "Alert type": "Operational",
    "ID":  "v70-57"
  },
  {
    "Condition ID": "v70-0x90006",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "SCSI Xcopy command failed on virtual volume due to an internal memory allocation issue",
    "Description": "Run the collect- diagnostics utility to collect system information to determine why an internal firmware memory allocation failure occurred. Contact Dell Customer Support.",
    "RCA": "The metro node director had insufficient memory resources to process the Scsi Xcopy Command.",
    "Corrective action": "Run the collect- diagnostics utility to collect system information to determine why an internal firmware memory allocation failure occurred. Contact Dell Customer Support.",
    "Event source": "VIRTUALVO LUME",
    "Alert type": "Operational",
    "ID":  "v70-58"
  },
  {
    "Condition ID": "v70-0x90007",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "SCSICompare and Write command failed on virtual volume it could not be processed by internal layers",
    "Description": "SCSICompare and Write command failed on virtual volume it could not be processed by internal layers.",
    "RCA": "The attempt to start a transaction for a SCSI Compare and Write command failed as it could not be processed by the internal layers.",
    "Corrective action": "Contact Dell Customer Support.",
    "Event source": "VIRTUALVO LUME",
    "Alert type": "Operational",
    "ID":  "v70-59"
  },
  {
    "Condition ID": "v70-0x90008",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "SCSI Write Same (16) command failed on virtual volume as it could not be processed by the internal layers",
    "Description": "SCSI Write Same (16) command failed on virtual volume as it could not be processed by the internal layers.",
    "RCA": "The attempt to start a transaction for a SCSI Write Same command failed as it could not be processed by the internal layers.",
    "Corrective action": "Consult the Troubleshoo ting Entry related to VAAI in metro node SolVe Desktop. If it does not resolve, contact Dell Customer Support.",
    "Event source": "VIRTUALVO LUME",
    "Alert type": "Operational",
    "ID":  "v70-60"
  },
  {
    "Condition ID": "v70-0x90009",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "SCSICompare and Write command failed on volume due to an invalid block count",
    "Description": "SCSICompare and Write command failed on volume due to an invalid block count.",
    "RCA": "The host application or OS requested an invalid transfer size on a Scsi Compare and Write Command.",
    "Corrective action": "It is a host side issue. Investigate why the host application or OS is not respecting the maximum transfer size advertised by the metro node. Consult the Troubleshoo ting Entry in the VAAI section of SolVe Desktop for this event.If problem persists, contact Dell Customer Support.",
    "Event source": "VIRTUALVO LUME",
    "Alert type": "Operational",
    "ID":  "v70-61"
  },
  {
    "Condition ID": "v70-0x9000a",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "SCSICompare and Write command failed on volume due to a bad Logical Block Address",
    "Description": "SCSICompare and Write command failed on volume due to a bad Logical Block Address.",
    "RCA": "The host application or OS specified an out of range Logical Block Address on a SCSICompare and Write Command.",
    "Corrective action": "It is a host side issue. Investigate why the host application or OS is not respecting the maximum size of the volume. If problem persists, contact Dell Customer Support.",
    "Event source": "VIRTUALVO LUME",
    "Alert type": "Operational",
    "ID":  "v70-62"
  },
  {
    "Condition ID": "v70-0x9000b",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "SCSI UNMAPcommand received on volume which is not thin enabled",
    "Description": "SCSI UNMAPcommand received on volume which is not thin enabled.",
    "RCA": "SCSI Unmap command processing is rejected through metro node because the volume is not thin capable or thin  enabled.",
    "Corrective action": "Use the VPlexcli command \"virtual- volume set- thin-enabled true-v volume_na me\" to enable the thin-enabled property for th virtual volume.",
    "Event source": "VIRTUALVO LUME",
    "Alert type": "Operational",
    "ID":  "v70-63"
  },
  {
    "Condition ID": "v70-0x9000c",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Failed to process a SCSI Xcopy command on volume as xcopy- enabled attribute on the storage view is disabled",
    "Description": "Failed to process a SCSI Xcopy command on volume as xcopy- enable attribute on the storage view is disabled.",
    "RCA": "SCSI xcopy command processing is disabled on metro node.",
    "Corrective action": "Use the CLI command and set the xcopy- enabled attribute for the correspondi ng storage view to true. Refer to the metro node CLI guide.",
    "Event source": "STORAGEVI EW",
    "Alert type": "Operational",
    "ID":  "v70-64"
  },
  {
    "Condition ID": "v70-0x9000d",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Failed to process a Write Same (16)command on volume as write- same-16- enabled attribute is disabled on the storage view",
    "Description": "Failed to process a Write Same (16)command on volume as write- same-16- enabled attribute is disabled on the storage view.",
    "RCA": "Scsi Write Same command processing is disabled on metro node.",
    "Corrective action": "Use the CLI command and set the write- same-16- enabledattribute for the correspondi ng storage view to true. Refer to the metro node CLI guide.",
    "Event source": "STORAGEVI EW",
    "Alert type": "Operational",
    "ID":  "v70-65"
  },
  {
    "Condition ID": "v70-0x9000e",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Unintention al Front End Port Link Down",
    "Description": "Unintention al Link Down seen for Front End Target Port.",
    "RCA": "An enabled FE port has gone down as a result of FC cable pull, switch reboot or disabling switch port.",
    "Corrective action": "1. Check the FE port status in the 'ports' context of VPlexcli / clusters/ cluster-*/ directors/**/ports/ to verify if it's still in 'no-link' state. If it is, proceed to next steps.2. Check the switch and ensure it's operational, check the switch logs for errors that will indicate the root cause of the issue.3. Check the cabling and SFPs along the path, clean/ reset/ replace as needed.",
    "Event source": "TARGETPO RT",
    "Alert type": "Operational",
    "ID":  "v70-66"
  },
  {
    "Condition ID": "v70-0xb0001",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Recovery From One Director Failure Took Too Long",
    "Description": "Recovery from the failure of a single director took too long",
    "RCA": "Recovery from the failure of a single director took too long.",
    "Corrective action": "If the host application experienced a DU,confirm that all metro node volumes used by that application are in a healthy state. The applications affected will need to go through their recovery process.",
    "Event source": "SYSTEM",
    "Alert type": "Operational",
    "ID":  "v70-67"
  },
  {
    "Condition ID": "v70-0xb0002",
    "Severity": "INFO",
    "Call home": "True",
    "Alert name": "All Failure Recovery Complete",
    "Description": "Failure recovery has completed for all volumes.",
    "RCA": "Failure recovery has completed for all volumes.",
    "Corrective action": "It is an informationa l event only. No further action is required.",
    "Event source": "SYSTEM",
    "Alert type": "Operational",
    "ID":  "v70-68"
  },
  {
    "Condition ID": "v70-0xc0001",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Too Many Instances of given command running at once",
    "Description": "There are too many instances of the given command running at once.",
    "RCA": "There are already the maximum number of instances of the given managemen t command currently running, and another one cannot be started. The previous instances of the command may be stuck,and the cause of It must be investigated.",
    "Corrective action": "Contact Dell Customer Support.",
    "Event source": "DIRECTOR",
    "Alert type": "Operational",
    "ID":  "v70-69"
  },
  {
    "Condition ID": "v70-0xd0001",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Invalid Persisted Consistency Group Record",
    "Description": "A persisted record relating to a consistency group had a format unrecognize d by the system. The record is thus being ignored.",
    "RCA": "A persisted record relating to a consistency group had a format unrecognize d by the system. The record is thus being ignored.",
    "Corrective action": "Check for any missing consistency groups, and reconstruct these as required.Contact Dell Customer Support for assistance.",
    "Event source": "DIRECTOR",
    "Alert type": "Operational",
    "ID":  "v70-70"
  },
  {
    "Condition ID": "v70-0xd0002",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Automatic Detach On Consistency Group Failed",
    "Description": "Following a link or cluster failure, the configured winner settings on a consistency group were not able to come into effect, and I/O remains suspended on both clusters.",
    "RCA": "The system disallowed the automatic detach on the given consistency group, in order tpreserve consistency on the volumes in the set and avoid losing data.Cluster detach is disallowed when the cluster configured to become the winner needs data from the other cluster,and the necessary rebuild has not yet been completed.",
    "Corrective action": "If I/O must resume, then all required links should be brough up.",
    "Event source": "CONSISTEN CYGROUP",
    "Alert type": "Operational",
    "ID":  "v70-71"
  },
  {
    "Condition ID": "v70-0xf0001",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Non-volatile storage file system corruption detected",
    "Description": "Non-volatile storage filesystem corruption detected.",
    "RCA": "The non- volatile file system has been corrupted and must be repaired.",
    "Corrective action": "Contact Dell Customer Support.",
    "Event source": "METAVOLU ME",
    "Alert type": "Operational",
    "ID":  "v70-72"
  },
  {
    "Condition ID": "v70-0xf0002",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Couldn't read meta- volume header",
    "Description": "Couldn't read metavolume header - nvol not ready.",
    "RCA": "The non- volatile file system is either not configured or has been corrupted.",
    "Corrective action": "The file system should be reconfigured. Contact Dell Customer Support.",
    "Event source": "METAVOLU ME",
    "Alert type": "Operational",
    "ID":  "v70-73"
  },
  {
    "Condition ID": "v70-0xf0003",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "An  operation on the meta- volume has failed due to lack of space",
    "Description": "An  operation on the meta- volume has failed due to lack of space.",
    "RCA": "The non- volatile file system is not large enough to handle the amount of information that must be persisted.",
    "Corrective action": "Create a larger meta- volume.Contact Dell Customer Support for assistance.",
    "Event source": "METAVOLU ME",
    "Alert type": "Operational",
    "ID":  "v70-74"
  },
  {
    "Condition ID": "v70-0xf0004",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Write Error- Data was not written to the non- volatile file system",
    "Description": "A write error occurred and data was not written to the non- volatile file system",
    "RCA": "A write error occurred to the non- volatile file system and data was not written to disk.",
    "Corrective action": "Investigate why writing to the meta- volumefailed. If the failure cannot be corrected, create a new meta- volume and copy the in- memory data to the new meta- volume.Contact Dell Customer Support for assistance if necessary.",
    "Event source": "METAVOLU ME",
    "Alert type": "Operational",
    "ID":  "v70-75"
  },
  {
    "Condition ID": "v70-0x40001",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Director running a different version of the software detected.",
    "Description": "Director running a different version of the software detected.",
    "RCA": "Local directors are running different versions of software.",
    "Corrective action": "Contact Dell Customer Support.",
    "Event source": "DIRECTOR",
    "Alert type": "Operational",
    "ID":  "v70-76"
  },
  {
    "Condition ID": "v70-0x40002",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "The number of COM paths to remote director is smaller than expected in a standard configuratio n.",
    "Description": "The number of COM paths to remote director is smaller than expected in a standard configuratio n.",
    "RCA": "Fewer than expected paths to remote director.",
    "Corrective action": "Check the state of the COM port, making sure it is enabled. Check the cable, making sure it is properly plugged in. Check the switch if applicable, making sure it is operational and the correspondi ng port is enabled.Contact Dell Customer Support if this event persists.",
    "Event source": "DIRECTOR",
    "Alert type": "Operational",
    "ID":  "v70-77"
  },
  {
    "Condition ID": "v70-0x40003",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "The system failed to read an internal setting.",
    "Description": "The system failed to read an internal setting.",
    "RCA": "The system failed to read an internal setting. It will prevent the director from fully booting, thereby preventing it from processing I/O",
    "Corrective action": "Contact Dell Customer Support.",
    "Event source": "DIRECTOR",
    "Alert type": "Operational",
    "ID":  "v70-78"
  },
  {
    "Condition ID": "v70-0x120003",
    "Severity": "CRITICAL",
    "Call home": "True",
    "Alert name": "Acommunicat ions path has been disconnecte d",
    "Description": "Acommunicat ions path has been disconnecte d.",
    "RCA": "Acommunicat ions path has been disconnecte d due to network connectivity issues.",
    "Corrective action": "Check the WAN COM or LOCALCOM path that was disconnecte d, then check the switch logs for errors that will help pinpoint the root cause. If errors point to hardware issue check/ clean/ replace the cables and SFPs along the path.Engage Dell Customer Support if unable to determine the root cause.",
    "Event source": "COMMUNIC ATIONSPAT H",
    "Alert type": "Operational",
    "ID":  "v70-79"
  },
  {
    "Condition ID": "v70-0x150008",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "A Fibre Channel  port came online, but is unzoned.",
    "Description": "A Fibre Channel  port came online, but is unzoned.",
    "RCA": "Fibre Channel port is connected to a switch, but the port isn't in any zone yet.",
    "Corrective action": "Please verify: 1. That the port is cabled correctly. 2. That the switch zoning is complete and correct. Additionally, some switches need to enable the zoning configuratio n one more time to make the just- changed zoning configuratio n apply. If unable to resolve the issue engage Dell Customer Support.",
    "Event source": "VIRTUALPO RT",
    "Alert type": "Operational",
    "ID":  "v70-80"
  },
  {
    "Condition ID": "v70-0x15000d",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "When connecting to a switch, the port received a non-spec- compliant responseindi cating that the switch does not support any protocol version that metro node supports.",
    "Description": "When connecting to a switch, the port received a non-spec- compliant response indicating that the switch does not support any protocol version that metro node supports.",
    "RCA": "This switch is likely not compatible with metro node. Metro node is unable to register with the switch or perform fabric discovery. Because this response is non-spec- compliant, metro node is unable to report on which version ofthe spec the switch does support.",
    "Corrective action": "Check the connectivity support matrix from E-Lab Navigator to verify if the switch model and firmware is supported by Dell. If assistance is needed engage Dell Customer Support.",
    "Event source": "VIRTUALPO RT",
    "Alert type": "Operational",
    "ID":  "v70-81"
  },
  {
    "Condition ID": "v70-0x150010",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "When connecting to a switch, the port received a response indicating thatthe switch does not support any protocol version that metro node supports.",
    "Description": "When connecting to a switch, the port received a response indicating that the switch does not support any protocol version that metro node supports.",
    "RCA": "This switch is likely not compatible with metro node. Metro node is unable to register with the switch or perform fabric discovery.",
    "Corrective action": "Check the connectivity support matrix from E-Lab Navigator to verify if the switch model and firmware is supported by Dell. If assistance is needed engage Dell Customer Support.",
    "Event source": "VIRTUALPO RT",
    "Alert type": "Operational",
    "ID":  "v70-82"
  },
  {
    "Condition ID": "v70-0x150011",
    "Severity": "CRITICAL",
    "Call home": "True",
    "Alert name": "The indicated interface has encountered an internal error and has dumped diagnostics for chip vendor analysis.",
    "Description": "The indicated interface has encountered an internal error and has dumped diagnostics for chip vendor analysis.",
    "RCA": "The indicated interface has encountered an internal error and has dumped diagnostics for chip vendor analysis.",
    "Corrective action": "Contact Dell Customer Support.",
    "Event source": "INTERFACE",
    "Alert type": "Operational",
    "ID":  "v70-83"
  },
  {
    "Condition ID": "v70-0x150018",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "An attempt to communicat e with the switch has timed out.",
    "Description": "An attempt to communicat e with the switch has timed out.",
    "RCA": "It likely indicates either a physical communicat ion issue with the switch or a misbehaving switch.",
    "Corrective action": "Check the physical paths to the switch and verify good connectivity through reseat/ clean/ replacement of cables/ SFPs as needed.Check the switch logs for indications of frame drops or other problems. If unable to determine the cause engage Dell Customer Support.",
    "Event source": "VIRTUALPO RT",
    "Alert type": "Operational",
    "ID":  "v70-84"
  },
  {
    "Condition ID": "v70-0x150019",
    "Severity": "CRITICAL",
    "Call home": "True",
    "Alert name": "An internal command on this interface has failed unexpectedl y.",
    "Description": "An internal command on this interface has failed unexpectedl y.",
    "RCA": "An internal command on this interface has failed unexpectedl y.",
    "Corrective action": "Contact Dell Customer Support.",
    "Event source": "INTERFACE",
    "Alert type": "Operational",
    "ID":  "v70-85"
  },
  {
    "Condition ID": "v70-0x15001d",
    "Severity": "CRITICAL",
    "Call home": "True",
    "Alert name": "Chip error requires manual reset from Dell Customer Support.",
    "Description": "Chip error requires manual reset from Dell Customer Support.",
    "RCA": "The chip underlying the  specified interface (metro node port) has encountered an error condition and requires a manual reset from Dell Customer Support.",
    "Corrective action": "Contact Dell Customer Support to manually reset the chip.",
    "Event source": "INTERFACE",
    "Alert type": "Operational",
    "ID":  "v70-86"
  },
  {
    "Condition ID": "v70-0x15001e",
    "Severity": "CRITICAL",
    "Call home": "True",
    "Alert name": "Unrecovera ble chip error requires manual reset from Dell Customer Support.",
    "Description": "Unrecovera ble chip error requires manual reset from Dell Customer Support.",
    "RCA": "The chip hasencountered an error condition and no automated recovery is possible. The chip may now be unresponsiv e resulting in stuck IO. The chip must be manually reset by Dell Customer Support, and if that fails the director must be rebooted to recover from this issue.",
    "Corrective action": "Contact Dell Customer Support to manually reset the chip.",
    "Event source": "INTERFACE",
    "Alert type": "Operational",
    "ID":  "v70-87"
  },
  {
    "Condition ID": "v70-0x150001",
    "Severity": "--",
    "Call home": "False",
    "Alert name": "Discovery Starting",
    "Description": "Fabric discovery is starting due to successful fabric login.",
    "RCA": "Fabric discovery is starting due to successful fabric login.",
    "Corrective action": "No user action is required.",
    "Event source": "VIRTUALPO RT",
    "Alert type": "Operational",
    "ID":  "v70-88"
  },
  {
    "Condition ID": "v70-0x15000e",
    "Severity": "Info",
    "Call home": "False",
    "Alert name": "GS Same Revision Rejected Default",
    "Description": "When connecting to a switch using the default protocol version, the port received a non-spec- compliant response indicating that the switch does not support the default protocol version that metro node supports.",
    "RCA": "Because this response is non-spec- compliant, metro node is unable to determine which version of the spec that the switch does support.Metro node will try a protocol version that is known to work with some switches that act in this way.",
    "Corrective action": "No user action is required. Metro node is attempting to automaticall y recover from this issue. A different event will be emitted if further problems are encountered.",
    "Event source": "VIRTUALPO RT",
    "Alert type": "Operational",
    "ID":  "v70-89"
  },
  {
    "Condition ID": "v70-0x15000f",
    "Severity": "Info",
    "Call home": "False",
    "Alert name": "GS Revision Rejected Supported",
    "Description": "When connecting to a switch, the port received a response indicating that the switch does not support the default protocol version that metro node supports.However, the switch responded with an older protocol version that metro node does support.",
    "RCA": "Metro node will attempt to use the specified protocol version to communicate with the switch.",
    "Corrective action": "No user action is required.",
    "Event source": "VIRTUALPO RT",
    "Alert type": "Operational",
    "ID":  "v70-90"
  },
  {
    "Condition ID": "v70-0x70001",
    "Severity": "Warning",
    "Call home": "False",
    "Alert name": "Cluster Witness Disabled",
    "Description": "Cluster Witness is disabled.",
    "RCA": "This event is generated when Cluster Witness is administrati vely disabled.",
    "Corrective action": "If the Cluster Witness was disabled in error, re- enable it",
    "Event source": "CLUSTER",
    "Alert type": "Alarm",
    "ID":  "v70-91"
  },
  {
    "Condition ID": "v70-0x70002",
    "Severity": "Error",
    "Call home": "True",
    "Alert name": "Cluster Witness Server Connection Lost",
    "Description": "Cluster Witness Server Connection Lost",
    "RCA": "The cluster reporting this event has been unable to establish communicat ion with Cluster Witness Server. This may be due to the failure of the server or loss of network connectivity.",
    "Corrective action": "Check network connectivity between the local cluster and ClusterWitn ess Server. Check whether Cluster Witness Server VM is running. If connectivity is lost from both clusters, disable the Cluster Witness Server via metro nodeCLI until connectivity can be restored inorder to prevent data unavailabilit y on cluster partition. If the Problem persists, contact Dell EMCCustomer Support.",
    "Event source": "CLUSTER",
    "Alert type": "Alarm",
    "ID":  "v70-92"
  },
  {
    "Condition ID": "v70-0x70003",
    "Severity": "Warning",
    "Call home": "False",
    "Alert name": "CW Cluster Partition Guidance",
    "Description": "Communicat ion between clusters is broken.",
    "RCA": "Cluster Witness Server has detected and reported an inter-cluster partition.This marks the loss of connectivity between the remote cluster and the reporting cluster. This may be due to physical failure or congestion of the inter- cluster network.",
    "Corrective action": "If the Cluster Witness Server is present and enabled, it should have provided guidance to continue IO on the winning cluster. If the Cluster Witness Server is not present, check that the distributed devices and consistency groups are running on the winning cluster. If the problem persists, contact Dell EMCCustomer Support.",
    "Event source": "CLUSTER",
    "Alert type": "Alarm",
    "ID":  "v70-93"
  },
  {
    "Condition ID": "v70-0x70004",
    "Severity": "Warning",
    "Call home": "False",
    "Alert name": "CW Remote Cluster Failure Or Isolation Guidance",
    "Description": "CW Remote Cluster Failure Or Isolation Guidance",
    "RCA": "Cluster Witness Server detected that the remote cluster has either failed or become isolated.This could be due to site disaster or due to dual failure of inter- cluster and managemen t networks.",
    "Corrective action": "Verify the state of the remote cluster.Also, check the state of inter-cluster network and the managemen t network connecting the remote cluster to Cluster Witness Server. If the problem persists, contact Dell EMC Customer Support.",
    "Event source": "CLUSTER",
    "Alert type": "Alarm",
    "ID":  "v70-94"
  },
  {
    "Condition ID": "v70-0x70005",
    "Severity": "Error",
    "Call home": "True",
    "Alert name": "CW Cluster Isolation Guidance Or No Guidance",
    "Description": "CW Cluster Isolation Guidance Or No Guidance",
    "RCA": "The cluster reporting this event has been unable to receive any guidance from the Cluster Witness Server for the last 10 seconds.This may be due to failure of the Cluster Witness Server or loss of network connectivity.",
    "Corrective action": "A winner must be manually chosen for all suspended synchronous consistency-groups using the VPlexcli command \"consistenc y-group choose- winner\" in order to resume I/O at the wanted cluster.Once this is complete, check network connectivity between the local cluster and Cluster Witness Server.Check whether Cluster Witness Server VM is running. If the problem persists, contact Dell EMCCustomer Support.",
    "Event source": "CLUSTER",
    "Alert type": "Alarm",
    "ID":  "v70-95"
  },
  {
    "Condition ID": "v70-0x70006",
    "Severity": "Critical",
    "Call home": "True",
    "Alert name": "CWInconsistent State Message Received",
    "Description": "CWInconsistent State Message Received",
    "RCA": "There are no known causes for this condition. Contact Dell EMCCustomer Support for assistance.",
    "Corrective action": "Contact Dell EMCCustomer Support for assistance.",
    "Event source": "CLUSTER",
    "Alert type": "Operational",
    "ID":  "v70-96"
  },
  {
    "Condition ID": "v70-0x70007",
    "Severity": "Error",
    "Call home": "True",
    "Alert name": "Cluster Witness Connection Lost",
    "Description": "Cluster Witness Connection Lost",
    "RCA": "The director reporting this event is unable to establish communicat ion with Cluster Witness Server. This may be due to the failure of the server or loss of network connectivity.",
    "Corrective action": "Check network connectivity between the director and Cluster Witness Server. Check whether Cluster Witness Server is running. If connectivity is lost from other directors, disable the Cluster Witness Server until connectivity is restored in order to prevent data unavailabilit y on cluster partition. If the problem persists, contact Dell EMCCustomer Support.",
    "Event source": "DIRECTOR",
    "Alert type": "Alarm",
    "ID":  "v70-97"
  },
  {
    "Condition ID": "v70-0x70008",
    "Severity": "Warning",
    "Call home": "True",
    "Alert name": "Cluster Witness Intermittent Communicat ion",
    "Description": "Cluster Witness Intermittent Communicat ion",
    "RCA": "This event is generated when Cluster Witness is unable to send requests or receive responses from Cluster Witness server.",
    "Corrective action": "Check network connectivity or network bandwidth between the director and Cluster Witness Server.",
    "Event source": "DIRECTOR",
    "Alert type": "Alarm",
    "ID":  "v70-98"
  },
  {
    "Condition ID": "v70-0xa0000",
    "Severity": "Critical",
    "Call home": "True",
    "Alert name": "SFPUnsupporte d",
    "Description": "The installed SFP is not a Dell EMC approved part for this interface.",
    "RCA": "The part number of the SFP is not approved. It is required to use Dell EMCapproved SFPs.",
    "Corrective action": "Contact Dell EMCCustomer Support to replace the SFP with an approved part.",
    "Event source": "INTERFACE",
    "Alert type": "Alarm",
    "ID":  "v70-99"
  },
  {
    "Condition ID": "v70-0xa0001",
    "Severity": "Critical",
    "Call home": "True",
    "Alert name": "SFP Absent",
    "Description": "SFP is absent or malfunctioni ng.",
    "RCA": "An SFP is missing, inserted incorrectly, or faulty.",
    "Corrective action": "Contact Dell EMCCustomer Support to check/replace the SFP.",
    "Event source": "INTERFACE",
    "Alert type": "Alarm",
    "ID":  "v70-100"
  },
  {
    "Condition ID": "v70-0xa0002",
    "Severity": "Critical",
    "Call home": "True",
    "Alert name": "SFP RxPower Low",
    "Description": "A port RX power is below the warning or alarm threshold.",
    "RCA": "A port's RX power is below the warning or alarm threshold.",
    "Corrective action": "The hardware attached to this port must be carefully investigated, and the switch port SFP and cable should be re- seated, cleaned, and swapped as needed.",
    "Event source": "INTERFACE",
    "Alert type": "Alarm",
    "ID":  "v70-101"
  },
  {
    "Condition ID": "v70-0xa0003",
    "Severity": "Critical",
    "Call home": "True",
    "Alert name": "SFP RxPower High",
    "Description": "A port RX power is above the warning or alarm threshold.",
    "RCA": "A port's RX power is above the warning or alarm threshold.",
    "Corrective action": "The hardware attached to this port must be carefully investigated, and the switch port SFP and cable should be re- seated, cleaned, and swapped as needed.",
    "Event source": "INTERFACE",
    "Alert type": "Alarm",
    "ID":  "v70-102"
  },
  {
    "Condition ID": "v70-0xa0004",
    "Severity": "Critical",
    "Call home": "True",
    "Alert name": "SFP TxPower Low",
    "Description": "A port TX power is below the warning or alarm threshold.",
    "RCA": "A port's TX power is below the warning or alarm threshold.",
    "Corrective action": "Contact Dell EMCCustomer Support to replace the SFP.",
    "Event source": "INTERFACE",
    "Alert type": "Alarm",
    "ID":  "v70-103"
  },
  {
    "Condition ID": "v70-0xa0005",
    "Severity": "Critical",
    "Call home": "True",
    "Alert name": "SFP TxPower High",
    "Description": "A port TX power is above the warning or alarm threshold.",
    "RCA": "A port's TX power is above the warning or alarm threshold.",
    "Corrective action": "Contact Dell EMCCustomer Support to replace the SFP.",
    "Event source": "INTERFACE",
    "Alert type": "Alarm",
    "ID":  "v70-104"
  },
  {
    "Condition ID": "v70-0x13006f",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Discoverer Header CRC Error",
    "Description": "The local port received an invalid header from the remote port (CRC check failed).",
    "RCA": "A tcpcom connection header failed to pass CRC checks.",
    "Corrective action": "The system should recover automatically. However, the underlying network and hardware must be investigated to determine the source of the corrupt packet.Contact Dell EMCCustomer Support for assistance.",
    "Event source": "PORT",
    "Alert type": "Operational",
    "ID":  "v70-105"
  },
  {
    "Condition ID": "v70-0x1300c8",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Path Indictment",
    "Description": "A tcpcom path has been indicted.",
    "RCA": "A tcpcom path has been indicted.",
    "Corrective action": "The system should recover automatically. However, the underlying network and hardware must be investigated to determine the cause of the error. Contact DELL EMCCustomer Support for assistance.",
    "Event source": "COMMUNIC ATIONSPAT H",
    "Alert type": "Operational",
    "ID":  "v70-106"
  },
  {
    "Condition ID": "v70-0x1300c9",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Path Indictment CRC",
    "Description": "A tcpcom path has been indicted due to a received packet failing a CRC check.",
    "RCA": "A tcpcom path has been indicted due to a received packet failing a CRC check.",
    "Corrective action": "The system should recover automatically. However, the underlying network and hardware must be investigated to determine the cause of the CRC errors. Contact DELL EMCCustomer Support for assistance.",
    "Event source": "COMMUNIC ATIONSPAT H",
    "Alert type": "Operational",
    "ID":  "v70-107"
  },
  {
    "Condition ID": "v70-0x1300ca",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Path Indictment Message Length",
    "Description": "A tcpcom path has been indicted due to a received packet having an invalid message length.",
    "RCA": "A tcpcom path has been indicted due to a received packet having an invalid message length.",
    "Corrective action": "The system should recover automatically. However, the underlying network and hardware must be investigated to determine the cause of the invalid packets.Contact DELL EMCCustomer Support for assistance.",
    "Event source": "COMMUNIC ATIONSPAT H",
    "Alert type": "Operational",
    "ID":  "v70-108"
  },
  {
    "Condition ID": "v70-0x1300cb",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Path Indictment Timeout",
    "Description": "A tcpcom path has been indicted due to a timeout.",
    "RCA": "A tcpcom path has been indicted due to a timeout.",
    "Corrective action": "The system should recover automatically. However, the underlying network and hardware must be investigated to determine the cause of the timeout. Contact DELL EMCCustomer Support for assistance.",
    "Event source": "COMMUNIC ATIONSPAT H",
    "Alert type": "Operational",
    "ID":  "v70-109"
  },
  {
    "Condition ID": "v70-0x170192",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Port No IO Resources Warning",
    "Description": "{vportName}: In the last{seconds} seconds, there were a high number of I/O allocation failures{initiatorIO}{targetIO}{targetResp onses}.",
    "RCA": "Either a large I/O spike has occurred, there are frame drop issues on the fabric, or there is an internal issue in the metro node.",
    "Corrective action": "Engage Dell EMCCustomer Service immediately if there is an outage or extreme performanc e issues.Check the switch logs from the fabric to determine if it is logged many frame drops, in which case further investigatio n of the fabric is needed.Switch one or more metro node ports in question  one at a time by disabling and re- enabling the port in the / clusters/ cluster-x/ directors/ director-x/ ports context of VPlexcli may relieve the issue.",
    "Event source": "VirtualPort",
    "Alert type": "Operational",
    "ID":  "v70-110"
  },
  {
    "Condition ID": "v70-0x170193",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Port High I/ O Error Rate",
    "Description": "{vportName}: In the last{seconds} seconds at least{numLogins} logins observed a high I/O failure rate.",
    "RCA": "Either there are frame drop issues on the fabric or there is an internal issue in the metro node.",
    "Corrective action": "Check the physical paths to the switch and verify good connectivity through reseat/ clean/ replacement of cables/ SFPs as needed.Check the switch logs for indications of frame drops or other problems. If unable to determine the cause engage Dell EMCCustomer Service.",
    "Event source": "VirtualPort",
    "Alert type": "Operational",
    "ID":  "v70-111"
  },
  {
    "Condition ID": "v70-0x170194",
    "Severity": "CRITICAL",
    "Call home": "True",
    "Alert name": "Port Detected Wedged",
    "Description": "{vportName} has outstanding activity but made no progress in the last{seconds} seconds. Initiating chip dump and firmware stop.",
    "RCA": "This port has outstanding I/O but failed to make progress for over 60 s, likely due to an internal issue.",
    "Corrective action": "Issue extended collect- diagnostics to collect the chip dump.Engage Dell EMCCustomer Service.",
    "Event source": "VirtualPort",
    "Alert type": "Operational",
    "ID":  "v70-112"
  },
  {
    "Condition ID": "v70-0x1701f5",
    "Severity": "WARNING",
    "Call home": "True",
    "Alert name": "Login High I/O Error Rate",
    "Description": "{vportName}: In the last{seconds} seconds{errorPerce nt}% of I/O failed on login (npid{npid}, wwpn{wwpn})",
    "RCA": "Either there are frame drop issues on the fabric or there is an internal issue in the metro node.",
    "Corrective action": "Check the physical paths to the switch and verify good connectivity through reseat/ clean/ replacement of cables/ SFPs as needed, including the connectivityof the metro node port. Check the switch logs for indications of frame drops or other problems. If unable to determine the cause engage Dell EMCCustomer Service.",
    "Event source": "VirtualPort",
    "Alert type": "Operational",
    "ID":  "v70-113"
  },
  {
    "Condition ID": "v70-0x190001",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "I/O Busy Threshold Reached",
    "Description": "The given storage volume reached the limit for the number of consecutive busy responses returned.",
    "RCA": "The storage volume returned many busy responses, and may be marked dead in metro node as a result, if the devices above have redundancy.",
    "Corrective action": "Engage array vendor in determining the cause of the returned SCSI busies. If the storage volume has been  marked dead, it is automaticall y resurrected by metro node once the array begins processing I/O for the storage volume again.",
    "Event source": "DiskId",
    "Alert type": "Operational",
    "ID":  "v70-114"
  },
  {
    "Condition ID": "v70-0x180001",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "One Disk HW After Sustained Success",
    "Description": "A storage volume encountered an I/O failure due to retry exhaustion after multiple consecutive I/O completions.",
    "RCA": "Multiple successive I/Os to a given disk failed after retry exhaustion. There might be faulty hardware (cable, backend switch, array).",
    "Corrective action": "Verify reported array's BE disk health, LUNmasking, array configuratio n and physical connection. If the problem persists, contact Dell EMCCustomer Support.",
    "Event source": "DiskId",
    "Alert type": "Operational",
    "ID":  "v70-115"
  },
  {
    "Condition ID": "v70-0x180002",
    "Severity": "ERROR",
    "Call home": "True",
    "Alert name": "Sustained Disk HW",
    "Description": "A storage volume encountered sustained I/ O failures due to retry exhaustion.",
    "RCA": "Multiple successive I/Os to a given disk failed after retry exhaustion. There might be faulty hardware (cable, backend switch, array).",
    "Corrective action": "Verify reported array's BE disk health, LUNmasking, array configuratio n, and physical connection. If the problem persists, contact Dell EMCCustomer Support.",
    "Event source": "DiskId",
    "Alert type": "Operational",
    "ID":  "v70-116"
  }
]
